// Άσκηση: Λογικοί Τελεστές
// Έλεγξε αν ένας αριθμός είναι μεταξύ 1 και 100

#include <iostream>
using namespace std;

int main() {
    int number;
    
    cout << "Δώσε έναν αριθμό: ";
    cin >> number;
    
    // TODO: Χρησιμοποίησε τον λογικό τελεστή && (AND)
    // Ο αριθμός πρέπει να είναι >= 1 ΚΑΙ <= 100
    if (number >= 1 __________ number <= 100) {
        cout << "Ο αριθμός είναι μεταξύ 1 και 100" << endl;
    }
    else {
        cout << "Ο αριθμός είναι εκτός ορίων" << endl;
    }
    
    return 0;
}
