# ΑΣΚΗΣΗ: Λογικές Εκφράσεις
#
# Βρες τι θα τυπώσει κάθε εντολή (True ή False)
# ΠΡΩΤΑ σκέψου, ΜΕΤΑ τρέξε τον κώδικα!
#
# Συμπλήρωσε σε σχόλιο δίπλα σε κάθε print
# την απάντησή σου πριν εκτελέσεις.

print(1 == 1 and 0 != 1)            # Απάντηση: ???
print("test" == 'test')             # Απάντηση: ???
print(False and 1 != 0)             # Απάντηση: ???
print(not (4 == 4 and 1 != 0))      # Απάντηση: ???
print(1 == 1 or 2 != 1 or 5 == 5)   # Απάντηση: ???
print(not (5 == 5 or (1 != 0 and 6 != 7)))  # Απάντηση: ???
